[
  {
    "type": "group",
    "label": {
      "en": "Bridge Settings",
      "nl": "Bridge instellingen",
      "it": "Impostazioni Bridge",
      "de": "Bridge Einstellungen"
    },
    "children": [
      {
        "id": "address",
        "$extends": "address"
      },
      {
        "id": "port",
        "$extends": "port"
      },
      {
        "id": "token",
        "$extends": "token"
      }
    ]
  },
  {
    "type": "group",
    "label": {
      "en": "Unlock duration, when unlocked by this app",
      "nl": "Ontgrendelen duur, wanneer ontgrendeld door deze app",
      "de": "Entsperrdauer, wenn von dieser App entsperrt",
      "it": "Durata sblocco, quando sbloccato da questa app"
    },
    "children": [
      {
        "id": "unlock_duration",
        "type": "radio",
        "value": "ring_to_open",
        "label": {
          "en": "Duration",
          "nl": "Duur",
          "de": "Dauer",
          "it": "Durata"
        },
        "hint": {
          "en": "When unlocked, Opener always immediately opens the main entrance door of the apartment building as soon as someone ring the doorbell.\nNuki calls this feature \"Ring to Open\".\n\nRing to Open usually has a timed duration (duration can be set via the Nuki smarphone app)\n\nThe unlocked state can always remain active by enabling the \"Continuous mode\".",
          "nl": "\"Wanneer ontgrendeld, Opener altijd onmiddellijk de hoofdingang opent zodra iemand aanbelt.\nNuki noemt deze functie \"Ring to Open\".\n\nRing to Open heeft meestal een beperkte duur (duur instelbaar via de Nuki smartphone app).\n\nDe ontgrendeld status kan altijd actief blijven door de \"Continumodus\" in te schakelen.",
          "de": "Im entsperrten Zustand öffnet Opener immer sofort die Haupteingangstür des Wohnhauses, sobald jemand an der Tür klingelt.\nNuki nennt diese Funktion \"Ring to Open\".\n\n\"Ring to Open\" hat normalerweise eine zeitgesteuerte Dauer (die Dauer kann über die Nuki Smartphone-App eingestellt werden).\n\nWählt man den “Dauermodus” aus, wird der Zustand entsperrt dauerhaft aktiviert.",
          "it": "Quando sbloccato, Opener apre automaticamente la porta d'ingresso del condominio non appena qualcuno suona il campanello. Nuki chiama questa funzionalità \"Ring to Open\"\n\n Solitamente Ring to Open ha una durata limitata (la durata può essere impostata dall'app per smartphone di Nuki).\n\nLo stato sbloccato può rimanere sempre attivo abilitando la \"Modalità continua\"."
        },
        "values": [
          {
            "id": "ring_to_open",
            "label": {
              "en": "Timed (Ring to Open)"
            }
          },
          {
            "id": "continuous_mode",
            "label": {
              "en": "Continuous mode",
              "nl": "Continumodus",
              "de": "Dauermodus",
              "fr": "Mode continu",
              "it": "Modalità continua",
              "es": "Modo continuo"
            }
          }
        ]
      }
    ]
  },
  {
    "type": "group",
    "label": {
      "en": "User Interface",
      "nl": "Gebruikersomgeving",
      "de": "Benutzeroberfläche",
      "it": "Interfaccia utente"
    },
    "children": [
      {
        "id": "open_action_visible",
        "$extends": "open_action_visible"
      }
    ]
  },
  {
    "type": "group",
    "label": {
      "en": "Power Settings",
      "nl": "Energie instellingen",
      "de": "Energieeinstellungen",
      "it": "Impostazioni alimentazione"
    },
    "children": [
      {
        "id": "battery",
        "type": "checkbox",
        "value": false,
        "label": {
          "en": "Battery operating",
          "nl": "Batterij werkt",
          "de": "Batteriebetrieb",
          "it": "Alimentazione a batteria"
        },
        "hint": {
          "en": "Enable this setting if your Nuki Opener is powered by batteries (leave disabled if the Opener is powered by USB cable). This setting allows Homey to manage device energy properly.",
          "nl": "Schakel deze instelling in als je Nuki Opener op batterijen werkt (laat deze instelling uitgeschakeld als de Opener wordt gevoed door een USB-kabel). Met deze instelling kan Homey de energie van het apparaat goed beheren.",
          "de": "Aktivieren Sie diese Einstellung, wenn Ihr Nuki Opener mit Batterien betrieben wird (lassen Sie diese Option deaktiviert, wenn der Opener über ein USB-Kabel betrieben wird). Mit dieser Einstellung kann Homey die Energie des Geräts ordnungsgemäß verwalten.",
          "it": "Abilitare questa impostazione se Nuki Opener è alimentato a batteria (lasciare disabilitato se il dispositivo è alimentato da cavo USB). Questa impostazione consente a Homey di gestire correttamente l'energia del dispositivo."
        }
      }
    ]
  }
]
