{
  "pair": {
    "intro": "Tragen Sie unten die Daten Ihrer Nuki Bridge ein.",
    "address": "IP-Adresse",
    "port": "Port",
    "token": "Token",
    "nukiid": "Nuki ID",
    "titleselection": "Was möchten Sie tun?",
    "nodevices": "Keine Nuki Bridge gefunden. Haben Sie während des Pairing-Vorgangs die Taste auf der Bridge gedrückt? Sie können es erneut versuchen oder, wenn Ihnen die IP-Adresse und das Token Ihrer Nuki Bridge bekannt sind, mit dem manuellen Pairing fortfahren.",
    "again": "Erneut versuchen",
    "manual": "Manuelles Pairing",
    "connect": "Verbinden",
    "unknownerror": "Unbekannter Fehler. Sind Sie sicher, dass Sie die richtigen Daten eingegeben haben und sich die Nuki Bridge im selben Netzwerk befindet wie Homey? Bitte überprüfen Sie Ihre Einstellungen und versuchen Sie es erneut.",
    "step1": "Stellen Sie zunächst sicher, dass die HTTP-API in Ihrer Nuki Bridge aktiviert ist. Dies können Sie in der Nuki Smartphone App tun. Gehen Sie dazu zu \"Meine Geräte verwalten\" und wählen Sie \"Bridge\". Dort können Sie dann die HTTP-API aktivieren.",
    "step2": "Sobald Sie die Funktion aktiviert haben, tippen Sie auf die Schaltfläche \"“Weiter >\" um den Vorgang fortzusetzen.",
    "step4": "Sobald der Suchvorgang läuft, drücken Sie die Taste auf der Nuki Bridge.",
    "step5": "Sollte dieser Vorgang fehlschlagen (z. B. weil die Taste auf der Nuki Bridge nicht gedrückt wurde), werden Sie zum manuellen Pairing-Vorgang aufgefordert.",
    "press_bridge_button": "Drücken Sie kurz die Taste auf der Nuki Bridge"
  },
  "util": {
    "uncalibrated": "Uncalibrated",
    "locked": "Locked",
    "unlocking": "Unlocking",
    "unlocked": "Unlocked",
    "locking": "Locking",
    "unlatched": "Unlatched",
    "unlocked_go": "Unlocked (Lock ‘n’ Go)",
    "unlatching": "Unlatching",
    "motor_blocked": "Motor Blocked",
    "undefined": "Undefined",
    "400": "Action invalid",
    "401": "Token is invalid",
    "403": "Authentication is disabled",
    "404": "Device is unknown, please re-pair your Nuki",
    "503": "Nuki Bridge is busy"
  },
  "app": {
    "unreachable": "Unreachable"
  },
  "driver": {
    "no_token": "Did not receive a token from the bridge, make sure you push the bridge button during pairing."
  },
  "device": {
    "untrained": "Untrained",
    "online": "Online",
    "rto_active": "Ring to Open",
    "open": "Open",
    "opening": "Opening",
    "boot_run": "Boot run",
    "continuous_mode":  "Ring to Open - CM"
  }
}
