{
  "pair": {
    "title": "Istruzioni",
    "intro": "Inserisci i dettagli del tuo Nuki Bridge.",
    "address": "Indirizzo IP",
    "port": "Porta",
    "token": "Token",
    "nukiid": "Nuki ID",
    "titleselection": "Come vuoi proseguire?",
    "nodevices": "Non è stato rilevato alcun Nuki Bridge. Hai premuto il bottone sul Bridge durante la fase di ricerca? Puoi riprovare oppure, se conosci IP, porta e token del tuo Bridge puoi proseguire con la procedura manuale.",
    "again": "Riprova",
    "manual": "Accoppiamento manuale",
    "test": "Test connessione",
    "testing": "Test connessione riuscito; ora puoi connettere il Nuki Bridge.",
    "connect": "Connetti",
    "success": "Nuki Bridge aggiunto con successo.",
    "bridgetype": "Tipo di bridge:",
    "unknownerror": "Errore sconosciuto, Sei sicuro di aver inserito le informazioni corrette e che il tuo Nuki bridge si trovi nella stessa sottorete di Homey? Per favore, controlla le impostazioni e riprova.",
    "step1": "Innanzitutto assicurati che HTTP API sia abilitata nel tuo Nuki Bridge. Puoi effettuare la verifica dall'app per smartphone di Nuki. Seleziona dal menu \"Gestisci i miei dispositivi\" e poi scegli \"Bridge\". Proseguendo nella procedura potrai verificare che HTTP API sia abilitata.",
    "step2": "Una volta completata la verifica, continua questa procedura toccando il bottone \"Successivo >\"",
    "step4": "Mentre la ricerca è in corso premi il bottone sul tuo Nuki Bridge.",
    "step5": "I tuoi dispositivi saranno trovati e potrai completare la procedura",
    "nosettings": "Per favore, inserisci tutte le informazioni richieste."
  },
  "util": {
    "uncalibrated": "Uncalibrated",
    "locked": "Locked",
    "unlocking": "Unlocking",
    "unlocked": "Unlocked",
    "locking": "Locking",
    "unlatched": "Unlatched",
    "unlocked_go": "Unlocked (lock ‘n’ go)",
    "unlatching": "Unlatching",
    "motor_blocked": "Motor Blocked",
    "undefined": "Undefined",
    "400": "Action invalid",
    "401": "Token is invalid, please re-pair your Nuki",
    "404": "Smart Lock is unknown, please re-pair your Nuki",
    "503": "Smart Lock is offline"
  },
  "app": {
    "unreachable": "Non raggiungibile"
  },
  "driver": {
    "no_token": "Non è stato ricevuto un token dal Bridge; assicurati di premere il bottone del Bridge durante l'accoppiamento."
  },
  "device": {
    "untrained": "Untrained",
    "online": "Online",
    "rto_active": "Ring to Open",
    "open": "Open",
    "opening": "Opening",
    "boot_run": "Boot run",
    "continuous_mode":  "Ring to Open - CM"
  }
}
