{
  "pair": {
    "title": "Instructies",
    "intro": "Vul de details van je Nuki bridge hieronder in.",
    "address": "IP adres",
    "port": "Port",
    "token": "Token",
    "nukiid": "Nuki ID",
    "titleselection": "Wat wil je doen?",
    "nodevices": "Geen hardware Nuki bridge gevonden. Heb je op de knop van je bridge gedrukt tijdens het koppelen? Je kan het nog een keer proberen of je Nuki (software) bridge handmatig proberen toe te voegen als je het IP adres en token weet.",
    "again": "Probeer opnieuw",
    "manual": "Handmatig koppelen",
    "connect": "Verbind",
    "unknownerror": "Onbekende fout, weet je zeker dat je de juiste details hebt opgegeven en dat de Nuki bridge op hetzelfde netwerk zit als Homey? Controleer a.u.b. je instellingen en probeer het nog eens.",
    "step1": "Zorg er eerst voor dat de HTTP API in je Nuki Bridge is geactiveerd. Je kan dit doen via de Nuki smartphone app. Ga naar \"Beheer apparaten\" en selecteer \"Bridge\". Hier kan je de HTTP API inschakelen.",
    "step2": "Eenmaal ingeschakeld kan je de procedure vervolgen door op de knop \"Volgende\" te drukken.",
    "step4": "Druk op de knop van je Nuki Bridge als het zoekproces is gestart.",
    "step5": "Mocht deze procedure mislukken (bijvoorbeeld omdat de knop niet is ingedrukt), dan wordt u doorverwezen naar de handmatige koppelingsprocedure.",
    "press_bridge_button": "Druk op de knop van je Nuki Bridge"
  },
  "util": {
    "uncalibrated": "Niet gecalibreerd",
    "locked": "Vergrendeld",
    "unlocking": "Ontgrendelende",
    "unlocked": "Ontgrendeld",
    "locking": "Vergrendelende",
    "unlatched": "Geopend",
    "unlocked_go": "Ontgrendeld (Lock ‘n’ Go)",
    "unlatching": "Openende",
    "motor_blocked": "Motor geblokkeerd",
    "undefined": "Niet gedefinieerd",
    "400": "Actie is ongeldig",
    "401": "Token is ongeldig",
    "403":  "Authentication is disabled",
    "404": "Slot is onbekend, voeg je Nuki opnieuw toe a.u.b.",
    "503": "Nuki Bridge is druk"
  },
  "app": {
    "unreachable": "Onbereikbaar"
  },
  "driver": {
    "no_token": "Geen token van de bridge ontvangen, zorg ervoor dat je de knop van de bridge indrukt gedurende het pairen."
  },
  "device": {
    "untrained": "Untrained",
    "online": "Online",
    "rto_active": "Ring to Open",
    "open": "Open",
    "opening": "Opening",
    "boot_run": "Boot run",
    "continuous_mode": "Ring to Open - Cm"
  }
}
