{
  "pair": {
    "title": "Koppelen van Nuki bridge",
    "intro": "Vul de details van je Nuki bridge hieronder in.",
    "address": "IP adres",
    "port": "Port",
    "token": "Token",
    "nukiid": "Nuki ID",
    "titleselection": "Wat wil je doen?",
    "nodevices": "Geen hardware Nuki bridge gevonden. Je kan het nog een keer proberen of je Nuki (software) bridge handmatig proberen toe te voegen als je het IP adres en token weet.",
    "again": "Probeer opnieuw",
    "manual": "Handmatig koppelen",
    "test" : "Test connectie",
    "testing" : "Connectietest succesvol, je kan de Nuki bridge nu verbinden.",
    "connect": "Verbind",
    "success": "Nuki bridge succesvol toegevoegd.",
    "bridgetype": "Bridge type:",
    "unknownerror": "Onbekende fout, weet je zeker dat je de juiste details hebt opgegeven en dat de Nuki bridge op hetzelfde netwerk zit als Homey? Controleer a.u.b. je instellingen en probeer het nog eens.",
    "step1": "First enable the HTTP API in your Nuki Bridge. You can do this within the Nuki smartphone app. Go to manage your devices and select your Nuki Bridge. There you can enable the HTTP API.",
    "step2": "Once enabled go to the Homey app and add a Nuki Smart Lock as device by selecting the 'Nuki Smart Lock' app from the pairing wizard.",
    "step3": "Confirm adding a Nuki Smart Lock or Nuki Opener and wait for the discovery process to start.",
    "step4": "When the discovery process is running press the button of your Nuki Bridge(s).",
    "step5": "Your Nuki devices will be discovered and you can finish the pairing of your device(s)."
  },
  "util": {
    "uncalibrated": "Niet gecalibreerd",
    "locked": "Vergrendeld",
    "unlocking": "Ontgrendelende",
    "unlocked": "Ontgrendeld",
    "locking": "Vergrendelende",
    "unlatched": "Geopend",
    "unlocked_go": "Ontgrendeld (lock ‘n’ go)",
    "unlatching": "Openende",
    "motor_blocked": "Motor geblokkeerd",
    "undefined": "Niet gedefinieerd"
  },
  "app": {
    "400": "Actie is ongeldig",
    "401": "Token is ongeldig, voeg je Nuki opnieuw toe a.u.b.",
    "404": "Slot is onbekend, voeg je Nuki opnieuw toe a.u.b.",
    "503": "Slot is offline"
  },
  "driver": {
    "no_token": "Geen token van de bridge ontvangen, zorg ervoor dat je de knop van de bridge indrukt gedurende het pairen."
  },
  "device": {
    "untrained": "Ongetrained",
    "online": "Online",
    "rto active": "Ring om te openen",
    "open": "Open",
    "opening": "Openend",
    "boot_run": "Boot run"
  }
}
